{
  "id": "prayer-10",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "GOD ENJOYED",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 10,
  "content": {
    "type": "TextContent",
    "text": "thou incomprehensible but prayer-hearing god,\nKnown, but beyond knowledge,\nrevealed, but unrevealed,\nmy wants and welfare draw me to thee,\nfor thou hast never said, 'Seek ye me in vain'.\nTo thee I come in my difficulties, necessities, distresses;\npossess me with thyself,\nwith a spirit of grace and supplication,\nwith a prayerful attitude of mind,\nwith access into warmth of fellowship,\nso that in the ordinary concerns of life\nmy thoughts and desires may rise to thee,\nand in habitual devotion I may find a resource that will\nsoothe my sorrows, sanctify my successes,\nand qualify me in all ways for dealings with my fellow men.\nI bless thee that thou hast made me capable\nof knowing thee, the author of all being,\nof resembling thee, the perfection of all excellency,\nof enjoying thee, the source of all happiness.\nO God, attend me in every part of my arduous and trying pilgrimage;\nI need the same counsel, defence, comfort I found at my beginning.\nLet my religion be more obvious to my conscience,\nmore perceptible to those around.\nWhile Jesus is representing me in heaven, may I reflect him on earth,\nWhile he pleads my cause, may I show forth his praise.\nContinue the gentleness of thy goodness towards me,\nAnd whether I wake or sleep, let thy presence go with me,\nthy blessing attend me.\nThou hast led me on and I have found thy promises true,\nI have been sorrowful, but thou hast been my help,\nfearful, but thou hast delivered me,\ndespairing, but thou hast lifted me up.\nThy vows are ever upon me,\nAnd I praise thee, O God.",
    "formatting": null
  },
  "metadata": {
    "originalId": 10
  }
}