{
  "id": "prayer-192",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "SIXTH DAY EVENING THE MEDIATOR",
  "subtitle": null,
  "description": null,
  "section": "A Week's Shared Prayers",
  "sortOrder": 192,
  "content": {
    "type": "TextContent",
    "text": "O GOD OF ABRAHAM, ISAAC AND JACOB,\nWe hope in thy Word.\nThere we see thee, not on a fearful throne of judgment\nBut on a throne of grace\nwaiting to be gracious, and exalted in mercy.\nThere we hear thee saying, not 'Depart ye cursed,' but '\nLook unto me and be ye saved,\nfor I am God and there is none else.'\nThey that know thy name put their trust in thee.\nHow many now glorified in heaven, and what numbers living on\nearth,\nare thy witnesses, O God,\nexemplifying in their recovery from the ruins of the fall\nthe freeness, riches and efficacy of thy grace!\nAll that were ever saved were saved by thee,\nand will through eternity exclaim, 'Not unto us, but\nunto thy name give glory for thy mercy and truth's sake.'\nThou hast chosen to transact all thy concerns with us\nthrough a mediator in whom all fullness dwells\nand who is exalted to be prince and saviour.\nTo him we look, on him we depend, through him we are\njustified.\nMay we derive relief from his sufferings\nwithout ceasing to abhor sin,\nor to long after holiness;\nfeel the double efficacy of his blood,\ntranquillizing and cleansing our consciences;\ndelight in his service as well as in his sacrifice;\nbe constrained by his love\nto five not to ourselves but to him;\ncherish a grateful and cheerful disposition,\nnot murmuring and repining if our wishes are not indulged,\nor because some trials are blended with our enjoyments and impressed with the number and greatness of thy\nbenefits,\nmay we bless and praise thee at all times.",
    "formatting": null
  },
  "metadata": {
    "originalId": 192
  }
}