{
  "id": "prayer-29",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "THE SPIRIT'S WORK",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 29,
  "content": {
    "type": "TextContent",
    "text": "Thou who dost proceed from the Father and the Son,\nhave mercy on me.\nWhen thou didst first hover over chaos, order came to birth,\nbeauty robed the world, fruitfulness sprang forth.\nMove, I pray thee, upon my disordered heart;\nTake away the infirmities of unruly desires and hateful lusts;\nLift the mists and darkness of unbelief;\nBrighten my soul with the pure light of truth;\nMake it fragrant as the garden of paradise,\nrich with every goodly fruit,\nbeautiful with heavenly grace,\nradiant with rays of divine light.\nFulfil in me the glory of thy divine offices;\nBe my comforter, fight, guide, sanctifier;\nTake of the things of Christ and show them to my soul;\nThrough thee may I daily learn more of his love,\ngrace, compassion, faithfulness, beauty;\nLead me to the cross and show me his wounds,\nthe hateful nature of evil, the power of Satan;\nMay I there see my sins as the nails that transfixed him,\nthe cords that bound him,\nthe thorns that tore him,\nthe sword that pierced him.\nHelp me to find in his death the reality and immensity of his love.\nOpen for me the wondrous volumes of truth in his, 'It is finished'.\nIncrease my faith in the clear knowledge of\natonement achieved, expiation completed,\nsatisfaction made, guilt done away,\nmy debt paid, my sins forgiven,\nmy person redeemed, my soul saved,\nhell vanquished, heaven opened, eternity made mine.\nO Holy Spirit, deepen in me these saving lessons.\nWrite them upon my heart, that my walk be sin-loathing,\nsin-fleeing, Christ-loving;\nAnd suffer no devil's device to beguile or deceive me.",
    "formatting": null
  },
  "metadata": {
    "originalId": 29
  }
}