{
  "id": "prayer-30",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "THE SPIRIT AS TEACHER",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 30,
  "content": {
    "type": "TextContent",
    "text": "That which I know not, teach thou me,\nKeep me a humble disciple in the school of Christ,\nlearning daily there what I am in myself,\na fallen sinful creature,\njustly deserving everlasting destruction;\nO let me never lose sight of my need of a saviour,\nor forget that apart from him I am nothing, and can do nothing.\nOpen my undemanding to know die Holy Scriptures;\nReveal to my soul the counsels and works of the blessed Trinity;\nInstil into my dark mind the saving knowledge of Jesus;\nMake me acquainted with his covenant undertakings\nand his perfect fulfilment of them,\nthat by resting on his finished work\nI may find the Father's love in the Son,\nhis Father, my Father,\nand may be brought through thy influence\nto have fellowship with the Three in One.\nO lead me into all truth, thou Spirit of wisdom and revelation,\nthat I may know the things that belong unto my peace,\nand through thee be made anew.\nMake practical upon my heart the Father's love\nas thou hast revealed it in the Scriptures;\nApply to my soul the blood of Christ, effectually, continually,\nand help me to believe, with conscience comforted,\nthat it cleanseth from all sin;\nLead me from faith to faith,\nthat I may at all times have freedom to come to a reconciled\nFather,\nand may be able to maintain peace with him\nagainst doubts, fears, corruptions, temptations.\nThy office is to teach me to draw near to Christ with a pure heart,\nsteadfastly persuaded of his love,\nin the full assurance of faith.\nLet me never falter in this way.",
    "formatting": null
  },
  "metadata": {
    "originalId": 30
  }
}