{
  "id": "prayer-76",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "SHORTCOMINGS",
  "subtitle": null,
  "description": null,
  "section": "Penitence and Deprecation",
  "sortOrder": 76,
  "content": {
    "type": "TextContent",
    "text": "O LIVING GOD,\nI bless thee\nthat I see the worst of my heart as well as the best of it,\nthat I can sorrow for those sins that carry me from thee,\nthat it is thy deep and dear mercy to threaten punishment\nso that I may return, pray, live.\nMy sin is to look on my faults and be discouraged,\nor to look on my good and be puffed up.\nI fall short of thy glory every day by spending hours unprofitably,\nby thinking that the things I do are good,\nwhen they are not done to thy end,\nnor spring from the rules of thy Word.\nMy sin is to fear what never will be;\nI forget to submit to thy will, and fail to be quiet there.\nBut Scripture teaches me that thy active will\nreveals a steadfast purpose on my behalf,\nand this quietens my soul, and makes me love thee.\nKeep me always in the understanding\nthat saints mourn more for sin than other men,\nfor when they see how great is thy wrath against sin,\nand how Christ's death alone pacifies that wrath,\nthat makes them mourn the more.\nHelp me to see that although I am in the wilderness\nit is not all briars and barrenness.\nI have bread from heaven, streams from the rock,\nlight by day, fire by night,\nthy dwelling place and thy mercy seat.\nI am sometimes discouraged by the way,\nbut though winding and trying it is safe and short;\nDeath dismays me, but my great high priest stands in its waters,\nand will open me a passage,\nand beyond is a better country.\nWhile I live let my life be exemplary,\nWhen I die may my end be peace.",
    "formatting": null
  },
  "metadata": {
    "originalId": 76
  }
}