{
  "id": "prayer-81",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "PENITENCE",
  "subtitle": null,
  "description": null,
  "section": "Penitence and Deprecation",
  "sortOrder": 81,
  "content": {
    "type": "TextContent",
    "text": "I have been hasty and short in private prayer,\nO quicken my conscience to feel this folly,\nto bewail this ingratitude;\nMy first sin of the day leads into others,\nand it is just that thou shouldst withdraw thy presence\nfrom one who waited carelessly on thee.\nKeep me at all times from robbing thee,\nand from depriving my soul of thy due worship;\nLet me never forget\nthat I have an eternal duty to love, honour and obey thee,\nthat thou art infinitely worthy of such;\nthat if I fail to glorify thee\nI am guilty of infinite evil that merits infinite punishment,\nfor sin is the violation of an infinite obligation.\nO forgive me if I have dishonoured thee,\nMelt my heart, heal my backslidings,\nand open an intercourse of love.\nWhen the fire of thy compassion warms my inward man,\nand the outpourings of thy Spirit fill my soul,\nthen I feelingly wonder at my own depravity,\nand deeply abhor myself;\nthen thy grace is a powerful incentive to repentance,\nand an irresistible motive to inward holiness.\nMay I never forget\nThat thou hast my heart in thy hands.\nApply to it the merits of Christ's atoning blood whenever I sin.\nLet thy mercies draw me to thyself.\nWean me from all evil, mortify me to the world,\nand make me ready for my departure hence\nanimated by the humiliations of pentential love.\nMy soul is often a chariot without wheels,\nclogged and hindered in sin's miry clay;\nMount it on eagle's wings and cause it to soar upward to thyself.",
    "formatting": null
  },
  "metadata": {
    "originalId": 81
  }
}