{
  "id": "prayer-9",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "DIVINE MERCIES",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 9,
  "content": {
    "type": "TextContent",
    "text": "thou eternal god,\nThine is surpassing greatness, unspeakable goodness,\nsuper-abundant grace;\nI can as soon count the sands of ocean's 'lip' as number thy favours\ntowards me;\nI know but a part, but that part exceeds all praise.\nI thank thee for personal mercies,\nmeasure of health, preservation of body,\ncomforts of house and home, sufficiency of food and clothing,\ncontinuance of mental powers,\nmy family, their mutual help and support,\nthe delights of domestic harmony and peace,\nthe seats now filled that might have been vacant,\nmy country, church, Bible, faith.\nBut, O, how I mourn my sin, ingratitude, vileness,\nthe days that add to my guilt,\nthe scenes that witness my offending tongue;\nAll things in heaven, earth, around, within, without, condemn me--\nthe sun which sees my misdeeds,\nthe darkness which is light to thee,\nthe cruel accuser who justly charges me,\nthe good angels who have been provoked to leave me,\nthy countenance which scans my secret sins,\nthy righteous law, thy holy Word,\nmy sin-soiled conscience, my private and public life,\nmy neighbours, myself-\nall write dark things against me.\nI deny them not, frame no excuse, but confess, 'Father, I have sinned'.\nYet still I live, and fly repenting to thy outstretched arms;\nthou wilt not cast me off, for Jesus brings me near,\nthou wilt not condemn me, for he died in my stead,\nthou wilt not mark my mountains of sin, for he levelled all,\nand his beauty coven my deformities.\nO my God, I bid farewell to sin by clinging to his cross,\nhiding in his wounds, and sheltering in his side.",
    "formatting": null
  },
  "metadata": {
    "originalId": 9
  }
}