{
  "id": "prayer-12",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "MAN'S GREAT END",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 12,
  "content": {
    "type": "TextContent",
    "text": "lord of all being,\nThere is one thing that deserves my greatest care,\nthat calls forth my ardent desires,\nThat is, that I may answer the great end for which I am made--\nto glorify thee who hast given me being,\nand to do all the good I can for my fellow men;\nVerily life is not worth having\nif it be not improved for this noble purpose.\nYet, Lord, how little is this the thought of mankind!\nMost men seem to live for themselves,\nwithout much or any regard for thy glory,\nor for the good of others;\nThey earnestly desire and eagerly pursue\nthe riches, honours, pleasures of this life,\nas if they supposed that wealth, greatness, merriment,\ncould make their immortal souls happy;\nBut, alas, what false delusive dreams are these!\nAnd how miserable ere long will those be that sleep in them,\nfor all our happiness consists in loving thee,\nand being holy as thou art holy.\nO may I never fall into the tempers and vanities,\nthe sensuality and folly of the present world!\nIt is a place of inexpressible sorrow, a vast empty nothingness;\nTime is a moment, a vapour,\nand all its enjoyments are empty bubbles,\nfleeting blasts of wind,\nfrom which nothing satisfactory can be derived;\nGive me grace always to keep in covenant with thee,\nand to reject as delusion a great name here or hereafter,\ntogether with all sinful pleasures or profits.\nHelp me to know continually\nthat there can be no true happiness,\nno fulfilling of thy purpose for me,\napart from a life lived in and for the Son of thy love.",
    "formatting": null
  },
  "metadata": {
    "originalId": 12
  }
}