{
  "id": "prayer-123",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "LOVE SHED ABROAD",
  "subtitle": null,
  "description": null,
  "section": "Holy Aspirations",
  "sortOrder": 123,
  "content": {
    "type": "TextContent",
    "text": "My heart praises thee for the wonder of thy love in Jesus;\nHe is heaven's darling, but is for me the incarnate,\ndespised, rejected, crucified sin-bearer;\nIn him thy grace has almost out-graced itself,\nIn him thy love to rebels has reached its height;\nO to love thee with a love like this!\nMy heart is stone, melt it with thy love,\nMy heart is locked, let thy love be the master key to open it;\nO Father, I adore thee for thy great love in the gift of Jesus,\nO Jesus, I bless thee for resigning thy life for me,\nO Holy Spirit, I thank thee for revealing to me this mystery;\nGreat God, let thy Son see in me the travail of his soul!\nBring me away from my false trusts to rest in him, and him only.\nLet me not be so callous to his merit as not to love him,\nso indifferent to his blood as not to desire cleansing.\nLord Jesus, master, redeemer, saviour,\ncome and take entire possession of me;\nthis is thy right by purchase.\nIn the arms of love enfold and subdue my wilful spirit.\nTake, sanctify, use my every faculty.\nI am not ashamed of my hope,\nnor has my confidence led me into confusion.\nI trusted in thee regarding my innumerable sins,\nand thou hast cast them behind thy back.\nI trusted in thee when evils encompassed me,\nand thou broughtest me out into a wealthy place.\nI trusted in thee in an hour of distress,\nand thou didst not fail me, though faith trembled.\nO God of the eternal choice,\nO God of the restored possession purchased on the tree,\nO God of the effectual call,\nFather, Son, Holy Spirit,\nI adore thy glory, honour, majesty, power, dominion\nfor ever.",
    "formatting": null
  },
  "metadata": {
    "originalId": 123
  }
}