{
  "id": "prayer-125",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "CHRISTLIKENESS",
  "subtitle": null,
  "description": null,
  "section": "Holy Aspirations",
  "sortOrder": 125,
  "content": {
    "type": "TextContent",
    "text": "Dawn returns,\nBut without thy light within no outward light can profit;\nGive me the saving lamp of thy Spirit that I may see thee,\nthe God of my salvation, the delight of my soul,\nrejoicing over me in love.\nI commend my heart to thy watchful care,\nfor I know its treachery and power;\nGuard its every portal from the wily enemy,\nGive me quick discernment of his deadly arts,\nHelp me to recognize his bold disguise as an angel of light,\nand bid him begone.\nMay my words and works allure others to the highest walks\nof faith and love!\nMay loiterers be quickened to greater diligence by my example!\nMay worldlings be won to delight in acquaintance with thee!\nMay the timid and irresolute be warned of coming doom\nby my zeal for Jesus!\nCause me to be a mirror of thy grace,\nto show others the joy of thy service,\nMay my lips be well-tuned cymbals sounding thy praise,\nLet a halo of heavenly-mindedness sparkle around me\nand a lamp of kindness sunbeam my path.\nTeach me the happy art of attending to things temporal\nwith a mind intent on things eternal.\nSend me forth to have compasssion on the ignorant and miserable.\nHelp me to walk as Jesus walked,\nmy only Saviour and perfect model,\nhis mind my inward guest,\nhis meekness my covering garb.\nLet my happy place be amongst the poor in spirit,\nmy delight the gentle ranks of the meek.\nLet me always esteem others better than myself,\nand find in true humility an heirdom to two worlds.",
    "formatting": null
  },
  "metadata": {
    "originalId": 125
  }
}