{
  "id": "prayer-13",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "GOD HONOURED",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 13,
  "content": {
    "type": "TextContent",
    "text": "Praise waiteth for thee,\nand to render it is my noblest exercise;\nThis is thy due from all thy creatures,\nfor all thy works display thy attributes and fulfil thy designs;\nThe sea, dry land, winter cold, summer heat,\nmorning light, evening shade are full of thee,\nand thou givest me them richly to enjoy.\nThou art king of kings and lord of lords;\nAt thy pleasure empires rise and fall;\nAll thy works praise thee and thy saints bless thee;\nLet me be numbered with thy holy ones,\nresemble them in character and condition,\nsit with them at Jesus' feet.\nMay my religion be always firmly rooted in thy Word,\nmy understanding divinely informed,\nmy affections holy and heavenly,\nmy motives simple and pure,\nand my heart never wrong with thee.\nDeliver me from the natural darkness of my own mind,\nfrom the corruptions of my heart,\nfrom the temptations to which I am exposed,\nfrom the daily snares that attend me.\nI am in constant clanger while I am in this life;\nLet thy watchful eye ever be upon me for my defence,\nSave me from the power of my worldly and spiritual enemies\nand from all painful evils to which I have exposed myself.\nUntil the day of life dawns above\nlet there be unrestrained fellowship with Jesus;\nUntil fruition comes, may I enjoy the earnest of my inheritance,\nand the firstfruits of the Spirit;\nUntil I finish my course with joy may I pursue it with diligence,\nin every part display the resources of the Christian,\nand adorn the doctrine of thee my God in all things.",
    "formatting": null
  },
  "metadata": {
    "originalId": 13
  }
}