{
  "id": "prayer-152",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "CALVARY'S ANTHEM",
  "subtitle": null,
  "description": null,
  "section": "Gifts of Grace",
  "sortOrder": 152,
  "content": {
    "type": "TextContent",
    "text": "Thou hast led me singing to the cross\nwhere I fling down all my burdens and see them vanish,\nwhere my mountains of guilt are levelled to a plain,\nwhere my sins disappear, though they are the greatest that exist,\nand are more in number than the grains of fine sand;\nFor there is power in the blood of Calvary\nto destroy sins more than can be counted\neven by one from the choir of heaven.\nThou hast given me a hill-side spring\nthat washes clear and white,\nand I go as a sinner to its waters,\nbathing without hindrance in its crystal streams.\nAt the cross there is free forgiveness for poor and meek ones,\nand ample blessings that last for ever;\nThe blood of the Lamb is like a great river of infinite grace\nwith never any diminishing of its fullness\nas thirsty ones without number drink of it.\nO Lord, for ever will thy free forgiveness live\nthat was gained on the mount of blood;\nIn the midst of a world of pain\nit is a subject for praise in every place\na song on earth, an anthem in heaven,\nits love and virtue knowing no end.\nI have a longing for the world above\nwhere multitudes sing the great song,\nfor my soul was never created to love the dust of earth.\nThough here my spiritual state is frail and poor,\nI shall go on singing Calvary's anthem.\nMay I always know\nthat a clean heart full of goodness\nis more beautiful than the lily,\nthat only a clean heart can sing by night and by day,\nthat such a heart is mine when I abide at Calvary.",
    "formatting": null
  },
  "metadata": {
    "originalId": 152
  }
}