{
  "id": "prayer-159",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "SERVICE AND EQUIPMENT",
  "subtitle": null,
  "description": null,
  "section": "Service and Ministry",
  "sortOrder": 159,
  "content": {
    "type": "TextContent",
    "text": "THOU GOD OF MY END,\nThou hast given me a fixed disposition\nto go forth and spend my life for thee;\nIf it be thy will let me proceed in it;\nif not, then revoke my intentions.\nAll I want in life is such circumstances\nas may best enable me to serve thee in the world;\nTo this end I leave all my concerns in thy hand,\nbut let me not be discouraged,\nfor this hinders my spiritual fervency;\nEnable me to undertake some task for thee,\nfor this refreshes and animates my soul,\nso that I could endure all hardships and labours,\nand willingly suffer for thy name.\nBut, O what a death it is to strive and labour,\nto be always in a hurry and yet do nothing!\nAlas, time flies and I am of little use.\nO that I could be a flame of fire in thy service,\nalways burning out in one continual blaze\nFit me for singular usefulness in this world.\nFit me to exult in distresses of every kind\nif they but promote the advancement of thy kingdom.\nFit me to quit all hopes of the world's friendship,\nand give me a deeper sense of my sinfulness.\nFit me to accept as just desert from thee\nany trial that may befall me.\nFit me to be totally resigned to die denial of pleasures I desire,\nand to be content to spend my time with thee.\nFit me to pray with a sense of the joy of divine communion,\nto find all times happy seasons to my soul,\nto see my own nothingness,\nand wonder that I am allowed to serve thee.\nFit me to enter the blessed world where no unclean thing is,\nand to know thee with me always.",
    "formatting": null
  },
  "metadata": {
    "originalId": 159
  }
}