{
  "id": "prayer-170",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "A MINISTER'S PRAISES",
  "subtitle": null,
  "description": null,
  "section": "Service and Ministry",
  "sortOrder": 170,
  "content": {
    "type": "TextContent",
    "text": "O GOD, MY EXCEEDING JOY,\nSinging thy praises uplifts my heart,\nfor thou art a fountain of delight,\nand dost bless the soul that joys in thee.\nBut because of my heart's rebellion\nI cannot always praise thee as I ought;\nYet I will at all times rest myself\nin thy excellences, goodness, and loving-kindness.\nThou art in Jesus the object of inexpressible joy,\nand I take exceeding pleasure in the thought of thee.\nBut, Lord, I am sometimes thy enemy;\nmy nature revolts and wanders from thee.\nThough thou hast renewed me,\nyet evil corruptions urge me still to oppose thee.\nHelp me to extol thee with entire heart-submission,\nto be diligent in self-examination,\nto ask myself whether I am truly born again,\nwhether my spirit is the spirit of thy children,\nwhether my griefs are those that tear repenting hearts,\nwhether my joys are the joys of faith,\nwhether my confidence in Christ works by love\nand purifies the soul.\nGive me the sweet results of faith,\nin my secret character, and in my public life.\nCast cords of love around my heart,\nthen hold me and never let me go.\nMay the saviour's wounds sway me more than the sceptre of princes.\nLet me love thee in a love that covers and swallows up all,\nthat I may not violate my chaste union with the beloved;\nThere is much unconquered territory in my nature,\nscourge out the buyers and sellers of my soul's temple,\nand give me in return pure desires,\nand longings after perfect holiness.",
    "formatting": null
  },
  "metadata": {
    "originalId": 170
  }
}