{
  "id": "prayer-180",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "LORD'S DAY EVENING",
  "subtitle": null,
  "description": null,
  "section": "Service and Ministry",
  "sortOrder": 180,
  "content": {
    "type": "TextContent",
    "text": "May the dose of an earthly sabbath\nremind me that the last of diem will one day end.\nAnimate me with joy that in heaven praise will never cease,\nthat adoration will continue for ever,\nthat no flesh will grow weary,\nno congregations disperse,\nno affections flag,\nno thoughts wander,\nno will droop,\nbut all will be adoring love.\nGuard my mind from making ordinances my stay or trust,\nfrom hewing out broken cisterns,\nfrom resting on outward helps.\nWing me through earthly forms to thy immediate presence;\nMay my feeble prayers show me the emptiness and vanity of my sins\nDeepen in me the conviction that my most fervent prayers,\nand most lowly confessions, need to be repented of.\nMay my best services bring me nearer to the cross,\nand prompt me to cry, 'None but Jesus!'\nBy thy Spirit give abiding life to the lessons of this day:\nMay the seed sown take deep root and yield a full harvest\nLet all who see me take knowledge that I have been with thee\nthat thou hast taught me my need as a sinner,\nhast revealed a finished salvation to me,\nhast enriched me with all spiritual blessings,\nhast chosen me to show forth Jesus to others,\nhast helped me to dispel the mists of unbelief.\nO great creator, mighty protector, gracious preserver,\nthou dost load me with lovingkindnesses,\nand hast made me thy purchased possession,\nand redeemed me from all guilt;\nI praise and bless thee for my sabbath rest my calm conscience,\nmy peace of heart",
    "formatting": null
  },
  "metadata": {
    "originalId": 180
  }
}