{
  "id": "prayer-184",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "RETROSPECT AND PROSPECT",
  "subtitle": null,
  "description": null,
  "section": "Valediction",
  "sortOrder": 184,
  "content": {
    "type": "TextContent",
    "text": "SUPREME RULER OF THE VISIBLE AND INVISIBLE WORLDS,\nMy heart is drawn out to thee\nfor thy amazing grace and condescension.\nThou hast kept my conversion fresh before me,\nthat season of my first spiritual comfort\nwhen I passed through the Red Sea\nby a way I did not expect\nI rejoiced then for that unthought-of passage,\nthat delivered me from the fear of the Egyptian\nwhen I had almost despaired of life.\nI rejoice now as these things are fresh and lively in my mind.\nMy soul melts when I think of thy days of old with me,\nwhen a poor worthless creature\nwithout wisdom to direct or strength to help myself\nwas laid under the happy necessity\nof living upon thee and finding thy consolations large.\nThou art my divine treasury in whom all fullness dwells,\nmy life, hope, joy, peace, glory, end;\nMay I be daily more and more conformed to thee,\nwith the meekness and calmness of the Lamb in my soul,\nand a feeling sense of the felicity of heaven,\nwhere I long to join angels free from imperfections,\nwhere in me the image of my adored Saviour\nwill be completely restored,\nso that I may be fit for his enjoyments and employments.\nI am not afraid to look the king of terrors in the face,\nfor I know I shall be drawn, not driven, out of the world.\nUntil then let me continually glow and burn out for thee,\nand when the last great change shall come\nlet me awake in thy likeness,\nleaving behind me an example that will glorify thee\nwhile my spirit rejoices in heaven,\nand my memory is blessed upon earth,\nwith those who follow me praising thee for my life.",
    "formatting": null
  },
  "metadata": {
    "originalId": 184
  }
}