{
  "id": "prayer-59",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "THE GREAT DISCOVERY",
  "subtitle": null,
  "description": null,
  "section": "Redemption and Reconciliation",
  "sortOrder": 59,
  "content": {
    "type": "TextContent",
    "text": "I bless thee that I know thee.\nI once lived in the world, but was ignorant of its creator,\nwas partaker of thy providences, but knew not the provider,\nwas blind while enjoying the sunlight,\nwas deaf to all things spiritual, with voices all around me,\nunderstood many things, but had no knowledge of thy ways,\nsaw the world, but did not see Jesus only.\nO happy day, when in thy love's sovereignty\nthou didst look on me, and call me by grace.\nThen did the dead heart begin to beat,\nthe darkened eye glimmer with light,\nthe dull ear catch thy echo,\nand I turned to thee and found thee,\na God ready to hear, willing to save.\nThen did I find my heart at enmity to thee, vexing thy Spirit;\nThen did I fall at thy feet and hear thee thunder,\nThe soul that sinneth, it must die',\nBut when grace made me to know thee,\nand admire a God who hated sin,\nthy terrible justice held my will submissive.\nMy thoughts were then as knives cutting my head.\nThen didst thou come to me in silken robes of love,\nand I saw thy Son dying that I might live,\nand in that death I found my all.\nMy soul doth sing at the remembrance of that peace;\nThe gospel cornet brought a sound unknown to me before\nthat reached my heart - and I lived--\nnever to lose my hold on Christ or his hold on me.\nGrant that I may always weep to the praise of mercy found,\nand tell to others as long as I live,\nthat thou art a sin-pardoning God,\ntaking up the blasphemer and the ungodly,\nand washing them from their deepest stain.",
    "formatting": null
  },
  "metadata": {
    "originalId": 59
  }
}