{
  "id": "prayer-7",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "THE MOVER",
  "subtitle": null,
  "description": null,
  "section": "Father, Son, and Holy Spirit",
  "sortOrder": 7,
  "content": {
    "type": "TextContent",
    "text": "o supreme moving cause,\nMay I always be subordinate to thee,\nbe dependent upon thee,\nbe found in the path where thou dost walk,\nand where thy Spirit moves,\ntake heed of estrangement from thee,\nof becoming insensible to thy love.\nThou dost not move men like stones,\nbut dost endue them with life,\nnot to enable them to move without thee,\nbut in submission to thee, the first mover.\nO Lord, I am astonished at the difference\nbetween my receivings and my deservings,\nbetween the state I am now in and my past gracelessness,\nbetween the heaven I am bound for and the hell I merit.\nWho made me to differ, but thee?\nfor I was no more ready to receive Christ than were others;\nI could not have begun to love thee hadst thou not first loved me,\nor been willing unless thou hadst first made me so.\nO that such a crown should fit the head of such a sinner!\nsuch high advancement be for an unfruitful person!\nsuch joys for so vile a rebel!\nInfinite wisdom cast the design of salvation\ninto the mould of purchase and freedom;\nLet wrath deserved be written on the door of hell,\nBut the free gift of grace on the gate of heaven.\nI know that my sufferings are the result of my sinning,\nbut in heaven both shall cease;\nGrant me to attain this haven and be done with sailing,\nand may the gales of thy mercy blow me safely into harbour.\nLet thy love draw me nearer to thyself,\nwean me from sin, mortify me to this world,\nand make me ready for my departure hence.\nSecure me by thy grace as I sail across this stormy sea.",
    "formatting": null
  },
  "metadata": {
    "originalId": 7
  }
}