{
  "id": "prayer-70",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "HUMILIATION",
  "subtitle": null,
  "description": null,
  "section": "Penitence and Deprecation",
  "sortOrder": 70,
  "content": {
    "type": "TextContent",
    "text": "When clouds of darkness, atheism, and unbelief come to me,\nI see thy purpose of love\nin withdrawing the Spirit that I might prize him more,\nin chastening me for my confidence in past successes,\nthat my wound of secret godlessness might be cured.\nHelp me to humble myself before thee\nby seeing the vanity of honour as a conceit of men's minds,\nas standing between me and thee;\nby seeing that thy will must alone be done,\nas much in denying as in giving spiritual enjoyments;\nby seeing that my heart is nothing but evil,\nmind, mouth, life void of thee;\nby seeing that sin and Satan are allowed power in me\nthat I might know my sin, be humbled,\nand gain strength thereby;\nby seeing that unbelief shuts thee from me,\nso that I sense not thy majesty, power, mercy, or love.\nThen possess me, for thou only art good and worthy.\nThou dost not play in convincing me of sin,\nSatan did not play in tempting me to it,\nI do not play when I sink in deep mire,\nfor sin is no game, no toy, no bauble;\nLet me never forget that the heinousness of sin\nlies not so much in the nature of the sin committed,\nas in the greatness of the person sinned against.\nWhen I am afraid of evils to come, comfort me, by showing me\nthat in myself I am a dying, condemned wretch,\nbut that in Christ I am reconciled, made alive, and satisfied;\nthat I am feeble and unable to do any good,\nbut that in him I can do all things;\nthat what I now have in Christ is mine in part,\nbut that shortly I shall have it perfectly in heaven.",
    "formatting": null
  },
  "metadata": {
    "originalId": 70
  }
}