{
  "id": "prayer-82",
  "category": {
    "id": "valley-of-vision",
    "name": "Valley of Vision",
    "displayName": "Valley of Vision",
    "description": "Traditional prayers from the Puritan collection",
    "iconName": "book",
    "color": "#1976D2"
  },
  "contentType": "prayer",
  "title": "MAN A NOTHING",
  "subtitle": null,
  "description": null,
  "section": "Penitence and Deprecation",
  "sortOrder": 82,
  "content": {
    "type": "TextContent",
    "text": "I am a shell full of dust,\nbut animated with an invisible rational soul\nand made anew by an unseen power of grace;\nYet I am no rare object of valuable price,\nbut one that has nothing and is nothing,\nalthough chosen of thee from eternity,\ngiven to Christ, and born again;\nI am deeply convinced of the evil and misery of a sinful state,\nof the vanity of creatures,\nbut also of the sufficiency of Christ.\nWhen thou wouldst guide me I control myself,\nWhen thou wouldst be sovereign I rule myself.\nWhen thou wouldst take care of me I suffice myself.\nWhen I should depend on thy providings I supply myself,\nWhen I should submit to thy providence I follow my will,\nWhen I should study, love, honour, trust thee, I serve myself;\nI fault and correct thy laws to suit myself,\nInstead of thee I look to man's approbation,\nand am by nature an idolater.\nLord, it is my chief design to bring my heart back to thee.\nConvince me that I cannot be my own god, or make myself happy,\nnor my own Christ to restore my joy,\nnor my own Spirit to teach, guide, rule me.\nHelp me to see that grace does this by providential affliction,\nfor when my credit is god thou-dost cast me lower,\nwhen riches are my idol thou dost wing them away,\nwhen pleasure is my all thou dost turn it into bitterness.\nTake away my roving eye, curious ear, greedy appetite, lustful heart;\nShow me that none of these things\ncan heal a wounded conscience,\nor support a tottering frame,\nor uphold a departing spirit.\nThen take me to the cross and leave me there.",
    "formatting": null
  },
  "metadata": {
    "originalId": 82
  }
}