{
  "id": 1008,
  "name": "The Rosary of Ancient Blessings",
  "description": "A meditative rosary incorporating traditional Hebrew blessings and prayers, focusing on the character of God, presented with both Hebrew script and English translation.",
  "section": "Thematic",
  "type": "SIMPLE",
  "introSection": {
    "cross": {
      "title": "Opening Prayer",
      "content": "בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁהֶחֱיָנוּ וְקִיְּמָנוּ וְהִגִּיעָנוּ לַזְּמַן הַזֶּה. בְּנוֹכְחוּתְךָ, אָנוּ מְבַקְּשִׁים לְהִתְקָרֵב. אָמֵן.\n(Baruch atah Adonai Eloheinu Melech ha'olam, shehecheyanu v'kiyemanu v'higianu lazman hazeh. B'nochchutcha, anu mevakshim l'hitkarev. Amen.)\nBlessed are You, Lord our God, King of the universe, who has given us life, sustained us, and brought us to this moment. In Your presence, we seek to draw near. Amen.",
      "displayHint": "EMPHASIZED"
    },
    "firstLargeBead": {
      "title": "Declaration of Faith",
      "content": "שְׁמַע יִשְׂרָאֵל ה' אֱלֹהֵינוּ ה' אֶחָד.\n(Shema Yisrael Adonai Eloheinu Adonai Echad.)\nHear, O Israel: The LORD our God, the LORD is one.\nDeuteronomy 6:4"
    },
    "threeSmallBeads": [
      { "content": "בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל דִּבְרֵי תוֹרָה.\n(Baruch atah Adonai Eloheinu Melech ha'olam, asher kid'shanu b'mitzvotav v'tzivanu al divrei Torah.)\nBlessed are You, Lord our God, King of the universe, who has sanctified us with His commandments and commanded us concerning the words of Torah." },
      { "content": "בָּרוּךְ אַתָּה ה', גּוֹאֵל יִשְׂרָאֵל.\n(Baruch atah Adonai, go'el Yisrael.)\nBlessed are You, Lord, Redeemer of Israel." },
      { "content": "בָּרוּךְ אַתָּה ה', רוֹפֵא חוֹלִים.\n(Baruch atah Adonai, rofeh cholim.)\nBlessed are You, Lord, Healer of the sick." }
    ],
    "secondLargeBead": {
      "title": "Prayer for Guidance",
      "content": "דְּרָכֶיךָ ה' הוֹדִיעֵנִי, אֹרְחוֹתֶיךָ לַמְּדֵנִי. הַדְרִיכֵנִי בַאֲמִתֶּךָ וְלַמְּדֵנִי, כִּי אַתָּה אֱלֹהֵי יִשְׁעִי, אוֹתְךָ קִוִּיתִי כָּל הַיּוֹם.\n(Derachecha Adonai hodi'eini, orchotecha lamdeini. Hadricheni va'amitecha v'lamdeini, ki atah Elohei yish'i, otcha kiviti kol hayom.)\nLead us, O Lord, in Your truth and teach us, for You are the God of our salvation; for You we wait all the day long.\nPsalm 25:5"
    }
  },
  "decades": [
    {
      "number": 1,
      "theme": "God as Creator",
      "largeBead": {
        "title": "Blessing the Creator",
        "content": "בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא פְּרִי הָעֵץ.\n(Baruch atah Adonai Eloheinu Melech ha'olam, borei p'ri ha'eitz.)\nBlessed are You, Lord our God, King of the universe, who creates the fruit of the tree.\nFor all creation testifies to Your glory.\nPsalm 19:1",
        "scriptureReference": "Psalm 19:1"
      },
      "smallBeads": {
        "type": "SINGLE_REFRAIN",
        "refrain": {
          "content": "בָּרוּךְ אַתָּה ה', יוֹצֵר אוֹר.\n(Baruch atah Adonai, Yotzer Or.)\nBlessed are You, Lord, Fashioner of Light."
        }
      }
    },
    {
      "number": 2,
      "theme": "God as Provider",
      "largeBead": {
        "title": "Blessing the Provider",
        "content": "בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הַמּוֹצִיא לֶחֶם מִן הָאָרֶץ.\n(Baruch atah Adonai Eloheinu Melech ha'olam, haMotzi lechem min ha'aretz.)\nBlessed are You, Lord our God, King of the universe, who brings forth bread from the earth.\nYou open Your hand and satisfy the desire of every living thing.\nPsalm 145:16",
        "scriptureReference": "Psalm 145:16"
      },
      "smallBeads": {
        "type": "SINGLE_REFRAIN",
        "refrain": {
          "content": "בָּרוּךְ אַתָּה ה', הַזָּן אֶת הַכֹּל.\n(Baruch atah Adonai, hazan et hakol.)\nBlessed are You, Lord, who sustains all."
        }
      }
    },
    {
      "number": 3,
      "theme": "God as Redeemer",
      "largeBead": {
        "title": "Blessing the Redeemer",
        "content": "בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר נָתַן לָנוּ אֶת דֶּרֶךְ הַחַיִּים.\n(Baruch atah Adonai Eloheinu Melech ha'olam, asher natan lanu et Derech HaChayim.)\nBlessed are You, Lord our God, King of the universe, who has given us the Way of Life.\nFor in Christ, we have redemption through His blood.\nEphesians 1:7",
        "scriptureReference": "Ephesians 1:7"
      },
      "smallBeads": {
        "type": "SINGLE_REFRAIN",
        "refrain": {
          "content": "בָּרוּךְ אַתָּה ה', גּוֹאֵל.\n(Baruch atah Adonai, Go'el.)\nBlessed are You, Lord, Redeemer."
        }
      }
    },
    {
      "number": 4,
      "theme": "God as Holy",
      "largeBead": {
        "title": "Blessing the Holy One",
        "content": "קָדוֹשׁ קָדוֹשׁ קָדוֹשׁ ה' צְבָאוֹת, מְלֹא כָל הָאָרֶץ כְּבוֹדוֹ.\n(Kadosh, kadosh, kadosh Adonai Tzva'ot, m'lo chol ha'aretz k'vodo.)\nHoly, holy, holy is the LORD of hosts; the whole earth is full of His glory.\nIsaiah 6:3",
        "scriptureReference": "Isaiah 6:3"
      },
      "smallBeads": {
        "type": "SINGLE_REFRAIN",
        "refrain": {
          "content": "בָּרוּךְ אַתָּה ה', הַקָּדוֹשׁ.\n(Baruch atah Adonai, HaKadosh.)\nBlessed are You, Lord, the Holy One."
        }
      }
    },
    {
      "number": 5,
      "theme": "God as Peace",
      "largeBead": {
        "title": "Blessing of Peace",
        "content": "בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, עוֹשֶׂה הַשָּׁלוֹם.\n(Baruch atah Adonai Eloheinu Melech ha'olam, Oseh HaShalom.)\nBlessed are You, Lord our God, King of the universe, who makes peace.\nMay the Lord bless you and keep you; may the Lord make His face shine upon you and be gracious to you; may the Lord lift up His countenance upon you and give you peace.\nNumbers 6:24-26",
        "scriptureReference": "Numbers 6:24-26"
      },
      "smallBeads": {
        "type": "SINGLE_REFRAIN",
        "refrain": {
          "content": "שָׁלוֹם עֲלֵיכֶם.\n(Shalom Aleichem.)\nPeace be upon you."
        }
      }
    }
  ]
}